Utilizado Cisco Packet Tracer Version 8.2.0.0162 - Windows 10 64bits
Autor: Fernando Gabriel
_____________________________________________________________________________________________________________________________

Utilizar a rede criada na atividade 1 → atividade_avaliativa_1.pkt disponível em: https://github.com/fernandogabrieu/atividade_avaliativa1_redes_2

v.1 - DHCP (escolhido o n° de 8 endereços reservados (excluded_address)):

- Configuração DHCP no CLI do Router1:
Router1#configure terminal
Router1(config)#ip dhcp excluded-address 192.168.1.2 192.168.1.10
Router1(config)#ip dhcp pool poll_rede0
Router1(dhcp-config)#network 192.168.1.0 255.255.255.128
Router1(dhcp-config)#default-router 192.168.1.1
Router1(dhcp-config)#end

- Configuração DHCP no CLI do Router2:
Router2#configure terminal
Router2(config)#ip dhcp excluded-address 192.168.1.130 192.168.1.138
Router2(config)#ip dhcp pool poll_rede0
Router2(dhcp-config)#network 192.168.1.128 255.255.255.192
Router2(dhcp-config)#default-router 192.168.1.129
Router2(dhcp-config)#end

- Configuração DHCP no CLI do Router3:
Router3#configure terminal
Router3(config)#ip dhcp excluded-address 19.0.0.2 19.0.0.10
Router3(config)#ip dhcp pool poll_rede0
Router3(dhcp-config)#network 19.0.0.0 255.255.255.0
Router3(dhcp-config)#default-router 19.0.0.1
Router3(dhcp-config)#end

- Alterado nas configurações de todos os end's devices (pc's e server0) de static para DHCP 

_____________________________________________________________________________________________________________________________


v.2 - NAT

- Configuração NAT no Router0 para que as redes A e B, com endereços privados, possam utilizar o endereço da interface de saída do Router0:
Router0#configure terminal
Router0(config)#interface serial 0/1/0
Router0(config-if)#ip nat outside
Router0(config-if)#exit
Router0(config)#interface serial 0/0/1
Router0(config-if)#ip nat inside
Router0(config-if)#exit
Router0(config)#interface serial 0/0/0
Router0(config-if)#ip nat inside
Router0(config-if)#exit
Router0(config)#access-list 1 permit 192.168.1.0 0.0.0.127
Router0(config)#ip nat inside source list 1 interface serial 0/1/0 overload
Router0(config)#access-list 2 permit 192.168.1.128 0.0.0.63
Router0(config)#ip nat inside source list 2 interface serial 0/1/0 overload
Router0(config)#end

_____________________________________________________________________________________________________________________________


v.2 - ACL

Router0 não deve permitir que pacotes com endereços privados de origem
saiam para a rede externa;
access-list 123 deny ip 10.0.0.0 0.255.255.255 any
access-list 123 deny ip 172.16.0.0 0.15.255.255 any
access-list 123 deny ip 192.168.0.0 0.0.255.255 any
access-list 123 permit ip any any

o Server da rede do topo (19.0.0.0/24) aceita apenas HTTP das redes externas, os demais dispositivos da rede do topo (lembrando que pode ter mais do que o
único PC mostrado) não aceitam SSH e TELNET de outras redes:
	
Router3(config)#access-list 120 permit tcp any host 19.0.0.3 eq 80
Router3(config)#access-list 120 deny tcp any any eq 22
Router3(config)#access-list 120 deny tcp any any eq 23
Router3(config)#access-list 120 deny ip any host 19.0.0.3
Router3(config)#access-list 120 permit ip any any
Router3(config)#interface fa0/0
Router3(config-if)#ip access-group 120 out

o SSH e TELNET só podem ser executados internamente nas redes A e B – ou seja,
hosts da rede A podem executar TELNET e SSH em qualquer host da rede A, mas
não permite que os pacotes desses protocolos entrem na rede (ou não
permitem que saiam para a outra), e o mesmo vale para a rede B;

Router1(config)#access-list 121 deny tcp 192.168.1.0 0.0.0.127 any eq 22
Router1(config)#access-list 121 deny tcp 192.168.1.0 0.0.0.127 any eq 23
Router1(config)#access-list 121 permit ip any any
Router1(config)#interface se0/0/1
Router1(config-if)#ip access-group 121 out
Router1(config-if)#exit
Router1(config)#interface se0/0/0
Router1(config-if)#ip access-group 121 out

Router2(config)#access-list 122 deny tcp 192.168.1.128 0.0.0.63 any eq 22
Router2(config)#access-list 122 deny tcp 192.168.1.128 0.0.0.63 any eq 23
Router2(config)#access-list 122 permit ip any any
Router2(config)#interface Se0/0/1
Router2(config-if)#ip access-group 122 out
Router2(config)#interface Se0/0/0
Router2(config-if)#ip access-group 122 out